garyPenhook/PIC-Assembler/edc/PIC18F24Q24.PIC
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="SPI1TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x81">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:mask="0xff" edc:name="TXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0" edc:mask="0x1" edc:name="TXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1" edc:mask="0x1" edc:name="TXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2" edc:mask="0x1" edc:name="TXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB3" edc:mask="0x1" edc:name="TXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB4" edc:mask="0x1" edc:name="TXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB5" edc:mask="0x1" edc:name="TXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB6" edc:mask="0x1" edc:name="TXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB7" edc:mask="0x1" edc:name="TXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SPI1TCNT" edc:desc="" edc:name="SPI1TCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x82">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPI1TCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPI1TCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x82">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTL" edc:mask="0xff" edc:name="TCNTL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-----nnn" edc:cname="SPI1TCNTH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SPI1TCNTH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x83">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTH" edc:mask="0x7" edc:name="TCNTH" edc:nzwidth="0x3"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="SPI1CON0" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="SPI1CON0" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x84">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BMODE" edc:mask="0x1" edc:name="BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MST" edc:mask="0x1" edc:name="MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSBF" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1BMODE" edc:mask="0x1" edc:name="SPI1BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1MST" edc:mask="0x1" edc:name="SPI1MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1LSBF" edc:mask="0x1" edc:name="SPI1LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="SPI1SPIEN" edc:mask="0x1" edc:name="SPI1SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="SPI1CON1" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="SPI1CON1" edc:nzwidth="8" edc:por="0000-100" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x85">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDOP" edc:mask="0x1" edc:name="SDOP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDIP" edc:mask="0x1" edc:name="SDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP" edc:mask="0x1" edc:name="SSP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FST" edc:mask="0x1" edc:name="FST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1SDOP" edc:mask="0x1" edc:name="SPI1SDOP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIP" edc:mask="0x1" edc:name="SPI1SDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSP" edc:mask="0x1" edc:name="SPI1SSP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1FST" edc:mask="0x1" edc:name="SPI1FST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1CKP" edc:mask="0x1" edc:name="SPI1CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1CKE" edc:mask="0x1" edc:name="SPI1CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SMP" edc:mask="0x1" edc:name="SPI1SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
