garyPenhook/PIC-Assembler/edc/PIC18F24Q24.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSAH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSAH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF9">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0xff" edc:name="SSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA8" edc:mask="0x1" edc:name="SSA8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA9" edc:mask="0x1" edc:name="SSA9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA10" edc:mask="0x1" edc:name="SSA10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA11" edc:mask="0x1" edc:name="SSA11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA12" edc:mask="0x1" edc:name="SSA12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA13" edc:mask="0x1" edc:name="SSA13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA14" edc:mask="0x1" edc:name="SSA14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA15" edc:mask="0x1" edc:name="SSA15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="DMAnSSAU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="DMAnSSAU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFA">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0x3f" edc:name="SSA" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA16" edc:mask="0x1" edc:name="SSA16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA17" edc:mask="0x1" edc:name="SSA17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA18" edc:mask="0x1" edc:name="SSA18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA19" edc:mask="0x1" edc:name="SSA19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA20" edc:mask="0x1" edc:name="SSA20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA21" edc:mask="0x1" edc:name="SSA21" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnn--n-r" edc:cname="DMAnCON0" edc:desc="DMA control register 0" edc:impl="0xe5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--0-0" edc:name="DMAnCON0" edc:nzwidth="8" edc:por="000--0-0" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XIP" edc:mask="0x1" edc:name="XIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQEN" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DGO" edc:mask="0x1" edc:name="DGO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQEN" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnCON1" edc:desc="DMA control register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSTP" edc:mask="0x1" edc:name="SSTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMODE" edc:mask="0x3" edc:name="SMODE" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SMR" edc:mask="0x3" edc:name="SMR" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DSTP" edc:mask="0x1" edc:name="DSTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMODE" edc:mask="0x3" edc:name="DMODE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnAIRQ" edc:desc="DMA abort trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnAIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AIRQ" edc:mask="0xff" edc:name="AIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AIRQ0" edc:mask="0x1" edc:name="AIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ1" edc:mask="0x1" edc:name="AIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ2" edc:mask="0x1" edc:name="AIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ3" edc:mask="0x1" edc:name="AIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ4" edc:mask="0x1" edc:name="AIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ5" edc:mask="0x1" edc:name="AIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ6" edc:mask="0x1" edc:name="AIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ7" edc:mask="0x1" edc:name="AIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSIRQ" edc:desc="DMA start trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIRQ" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SIRQ0" edc:mask="0x1" edc:name="SIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ1" edc:mask="0x1" edc:name="SIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ2" edc:mask="0x1" edc:name="SIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ3" edc:mask="0x1" edc:name="SIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ4" edc:mask="0x1" edc:name="SIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ5" edc:mask="0x1" edc:name="SIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ6" edc:mask="0x1" edc:name="SIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ7" edc:mask="0x1" edc:name="SIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x1" edc:beginaddr="0x0100" edc:endaddr="0x0200" edc:regionid="sfr1">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTW" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTW" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x100">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RW0" edc:mask="0x1" edc:name="RW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW1" edc:mask="0x1" edc:name="RW1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW2" edc:mask="0x1" edc:name="RW2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW3" edc:mask="0x1" edc:name="RW3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW4" edc:mask="0x1" edc:name="RW4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW5" edc:mask="0x1" edc:name="RW5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW6" edc:mask="0x1" edc:name="RW6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW7" edc:mask="0x1" edc:name="RW7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATW" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LATW" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x101">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATW0" edc:mask="0x1" edc:name="LATW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW1" edc:mask="0x1" edc:name="LATW1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW2" edc:mask="0x1" edc:name="LATW2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW3" edc:mask="0x1" edc:name="LATW3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW4" edc:mask="0x1" edc:name="LATW4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW5" edc:mask="0x1" edc:name="LATW5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW6" edc:mask="0x1" edc:name="LATW6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW7" edc:mask="0x1" edc:name="LATW7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
