garyPenhook/PIC-Assembler/edc/PIC18F24Q24.PIC
        <edc:JoinedSFRDef edc:cname="TU16APR" edc:desc="" edc:name="TU16APR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3A5">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3A5">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRL0" edc:mask="0x1" edc:name="PRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL1" edc:mask="0x1" edc:name="PRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL2" edc:mask="0x1" edc:name="PRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL3" edc:mask="0x1" edc:name="PRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL4" edc:mask="0x1" edc:name="PRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL5" edc:mask="0x1" edc:name="PRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL6" edc:mask="0x1" edc:name="PRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL7" edc:mask="0x1" edc:name="PRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16APRL0" edc:mask="0x1" edc:name="TU16APRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL1" edc:mask="0x1" edc:name="TU16APRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL2" edc:mask="0x1" edc:name="TU16APRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL3" edc:mask="0x1" edc:name="TU16APRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL4" edc:mask="0x1" edc:name="TU16APRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL5" edc:mask="0x1" edc:name="TU16APRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL6" edc:mask="0x1" edc:name="TU16APRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRL7" edc:mask="0x1" edc:name="TU16APRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16APR0" edc:mask="0x1" edc:name="TU16APR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR1" edc:mask="0x1" edc:name="TU16APR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR2" edc:mask="0x1" edc:name="TU16APR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR3" edc:mask="0x1" edc:name="TU16APR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR4" edc:mask="0x1" edc:name="TU16APR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR5" edc:mask="0x1" edc:name="TU16APR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR6" edc:mask="0x1" edc:name="TU16APR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR7" edc:mask="0x1" edc:name="TU16APR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3A6">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRH0" edc:mask="0x1" edc:name="PRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH1" edc:mask="0x1" edc:name="PRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH2" edc:mask="0x1" edc:name="PRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH3" edc:mask="0x1" edc:name="PRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH4" edc:mask="0x1" edc:name="PRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH5" edc:mask="0x1" edc:name="PRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH6" edc:mask="0x1" edc:name="PRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH7" edc:mask="0x1" edc:name="PRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16APRH0" edc:mask="0x1" edc:name="TU16APRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH1" edc:mask="0x1" edc:name="TU16APRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH2" edc:mask="0x1" edc:name="TU16APRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH3" edc:mask="0x1" edc:name="TU16APRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH4" edc:mask="0x1" edc:name="TU16APRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH5" edc:mask="0x1" edc:name="TU16APRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH6" edc:mask="0x1" edc:name="TU16APRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRH7" edc:mask="0x1" edc:name="TU16APRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16APR8" edc:mask="0x1" edc:name="TU16APR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR9" edc:mask="0x1" edc:name="TU16APR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR10" edc:mask="0x1" edc:name="TU16APR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR11" edc:mask="0x1" edc:name="TU16APR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR12" edc:mask="0x1" edc:name="TU16APR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR13" edc:mask="0x1" edc:name="TU16APR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR14" edc:mask="0x1" edc:name="TU16APR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR15" edc:mask="0x1" edc:name="TU16APR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x3A7"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APRT" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3A8">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRT" edc:mask="0xff" edc:name="PRT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRT0" edc:mask="0x1" edc:name="PRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT1" edc:mask="0x1" edc:name="PRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT2" edc:mask="0x1" edc:name="PRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT3" edc:mask="0x1" edc:name="PRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT4" edc:mask="0x1" edc:name="PRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT5" edc:mask="0x1" edc:name="PRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT6" edc:mask="0x1" edc:name="PRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT7" edc:mask="0x1" edc:name="PRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16APRT0" edc:mask="0x1" edc:name="TU16APRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT1" edc:mask="0x1" edc:name="TU16APRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT2" edc:mask="0x1" edc:name="TU16APRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT3" edc:mask="0x1" edc:name="TU16APRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT4" edc:mask="0x1" edc:name="TU16APRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT5" edc:mask="0x1" edc:name="TU16APRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT6" edc:mask="0x1" edc:name="TU16APRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APRT7" edc:mask="0x1" edc:name="TU16APRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16APR24" edc:mask="0x1" edc:name="TU16APR24" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR25" edc:mask="0x1" edc:name="TU16APR25" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR26" edc:mask="0x1" edc:name="TU16APR26" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR27" edc:mask="0x1" edc:name="TU16APR27" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR28" edc:mask="0x1" edc:name="TU16APR28" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR29" edc:mask="0x1" edc:name="TU16APR29" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR30" edc:mask="0x1" edc:name="TU16APR30" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16APR31" edc:mask="0x1" edc:name="TU16APR31" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TU16ACLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="TU16ACLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16ACLK0" edc:mask="0x1" edc:name="TU16ACLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK1" edc:mask="0x1" edc:name="TU16ACLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK2" edc:mask="0x1" edc:name="TU16ACLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK3" edc:mask="0x1" edc:name="TU16ACLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLK4" edc:mask="0x1" edc:name="TU16ACLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TU16AERS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TU16AERS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3AA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0x3f" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS4" edc:mask="0x1" edc:name="ERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS5" edc:mask="0x1" edc:name="ERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16AERS0" edc:mask="0x1" edc:name="TU16AERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS1" edc:mask="0x1" edc:name="TU16AERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS2" edc:mask="0x1" edc:name="TU16AERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS3" edc:mask="0x1" edc:name="TU16AERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS4" edc:mask="0x1" edc:name="TU16AERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AERS5" edc:mask="0x1" edc:name="TU16AERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
