garyPenhook/PIC-Assembler/edc/PIC18F24Q24.PIC
        <edc:JoinedSFRDef edc:cname="ADUTH" edc:desc="" edc:name="ADUTH" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DB">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="UTH" edc:desc="" edc:mask="0xff" edc:name="UTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH0" edc:desc="" edc:mask="0x1" edc:name="ADUTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH1" edc:desc="" edc:mask="0x1" edc:name="ADUTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH2" edc:desc="" edc:mask="0x1" edc:name="ADUTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH3" edc:desc="" edc:mask="0x1" edc:name="ADUTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH4" edc:desc="" edc:mask="0x1" edc:name="ADUTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH5" edc:desc="" edc:mask="0x1" edc:name="ADUTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH6" edc:desc="" edc:mask="0x1" edc:name="ADUTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH7" edc:desc="" edc:mask="0x1" edc:name="ADUTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADUTH" edc:mask="0xff" edc:name="ADUTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="UTH0" edc:mask="0x1" edc:name="UTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH1" edc:mask="0x1" edc:name="UTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH2" edc:mask="0x1" edc:name="UTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH3" edc:mask="0x1" edc:name="UTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH4" edc:mask="0x1" edc:name="UTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH5" edc:mask="0x1" edc:name="UTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH6" edc:mask="0x1" edc:name="UTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH7" edc:mask="0x1" edc:name="UTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DC">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="UTH" edc:desc="" edc:mask="0xff" edc:name="UTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH8" edc:desc="" edc:mask="0x1" edc:name="ADUTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH9" edc:desc="" edc:mask="0x1" edc:name="ADUTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH10" edc:desc="" edc:mask="0x1" edc:name="ADUTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH11" edc:desc="" edc:mask="0x1" edc:name="ADUTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH12" edc:desc="" edc:mask="0x1" edc:name="ADUTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH13" edc:desc="" edc:mask="0x1" edc:name="ADUTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH14" edc:desc="" edc:mask="0x1" edc:name="ADUTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH15" edc:desc="" edc:mask="0x1" edc:name="ADUTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADUTH" edc:mask="0xff" edc:name="ADUTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="UTH8" edc:mask="0x1" edc:name="UTH8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH9" edc:mask="0x1" edc:name="UTH9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH10" edc:mask="0x1" edc:name="UTH10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH11" edc:mask="0x1" edc:name="UTH11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH12" edc:mask="0x1" edc:name="UTH12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH13" edc:mask="0x1" edc:name="UTH13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH14" edc:mask="0x1" edc:name="UTH14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH15" edc:mask="0x1" edc:name="UTH15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADERR" edc:desc="" edc:name="ADERR" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DD">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADERRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR" edc:desc="" edc:mask="0xff" edc:name="ERR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR0" edc:desc="" edc:mask="0x1" edc:name="ADERR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR1" edc:desc="" edc:mask="0x1" edc:name="ADERR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR2" edc:desc="" edc:mask="0x1" edc:name="ADERR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR3" edc:desc="" edc:mask="0x1" edc:name="ADERR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR4" edc:desc="" edc:mask="0x1" edc:name="ADERR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR5" edc:desc="" edc:mask="0x1" edc:name="ADERR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR6" edc:desc="" edc:mask="0x1" edc:name="ADERR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR7" edc:desc="" edc:mask="0x1" edc:name="ADERR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADERR" edc:mask="0xff" edc:name="ADERR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ERR0" edc:mask="0x1" edc:name="ERR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR1" edc:mask="0x1" edc:name="ERR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR2" edc:mask="0x1" edc:name="ERR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR3" edc:mask="0x1" edc:name="ERR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR4" edc:mask="0x1" edc:name="ERR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR5" edc:mask="0x1" edc:name="ERR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR6" edc:mask="0x1" edc:name="ERR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR7" edc:mask="0x1" edc:name="ERR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADERRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR" edc:desc="" edc:mask="0xff" edc:name="ERR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR8" edc:desc="" edc:mask="0x1" edc:name="ADERR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR9" edc:desc="" edc:mask="0x1" edc:name="ADERR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR10" edc:desc="" edc:mask="0x1" edc:name="ADERR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR11" edc:desc="" edc:mask="0x1" edc:name="ADERR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR12" edc:desc="" edc:mask="0x1" edc:name="ADERR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR13" edc:desc="" edc:mask="0x1" edc:name="ADERR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR14" edc:desc="" edc:mask="0x1" edc:name="ADERR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR15" edc:desc="" edc:mask="0x1" edc:name="ADERR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADERR" edc:mask="0xff" edc:name="ADERR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ERR8" edc:mask="0x1" edc:name="ERR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR9" edc:mask="0x1" edc:name="ERR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR10" edc:mask="0x1" edc:name="ERR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR11" edc:mask="0x1" edc:name="ERR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR12" edc:mask="0x1" edc:name="ERR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR13" edc:mask="0x1" edc:name="ERR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR14" edc:mask="0x1" edc:name="ERR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR15" edc:mask="0x1" edc:name="ERR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADSTPT" edc:desc="" edc:name="ADSTPT" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DF">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADSTPTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADSTPTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DF">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="STPT" edc:desc="" edc:mask="0xff" edc:name="STPT" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADSTPT0" edc:desc="" edc:mask="0x1" edc:name="ADSTPT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT1" edc:desc="" edc:mask="0x1" edc:name="ADSTPT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT2" edc:desc="" edc:mask="0x1" edc:name="ADSTPT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT3" edc:desc="" edc:mask="0x1" edc:name="ADSTPT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT4" edc:desc="" edc:mask="0x1" edc:name="ADSTPT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT5" edc:desc="" edc:mask="0x1" edc:name="ADSTPT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT6" edc:desc="" edc:mask="0x1" edc:name="ADSTPT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT7" edc:desc="" edc:mask="0x1" edc:name="ADSTPT7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADSTPT" edc:mask="0xff" edc:name="ADSTPT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="STPT0" edc:mask="0x1" edc:name="STPT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT1" edc:mask="0x1" edc:name="STPT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT2" edc:mask="0x1" edc:name="STPT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT3" edc:mask="0x1" edc:name="STPT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT4" edc:mask="0x1" edc:name="STPT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT5" edc:mask="0x1" edc:name="STPT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT6" edc:mask="0x1" edc:name="STPT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT7" edc:mask="0x1" edc:name="STPT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
