garyPenhook/PIC-Assembler/edc/PIC18F24Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUA" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x401">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUA0" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA1" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA2" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA3" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA4" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA5" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA6" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA7" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONA" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x402">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCA0" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA1" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA2" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA3" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA4" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA5" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA6" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA7" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONA" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x403">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA1" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA3" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA4" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA5" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA6" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA7" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLA" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x404">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA6" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA7" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x405">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP6" edc:mask="0x1" edc:name="IOCAP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP7" edc:mask="0x1" edc:name="IOCAP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x406">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN6" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN7" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
