garyPenhook/PIC-Assembler/edc/PIC18F24Q24.PIC
        <edc:JoinedSFRDef edc:cname="PWM3PR" edc:desc="" edc:name="PWM3PR" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x481">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3PRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x481">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3PRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x482">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3CPRE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3CPRE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x483">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPRE" edc:mask="0xff" edc:name="CPRE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PIPOS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3PIPOS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x484">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIPOS" edc:mask="0xff" edc:name="PIPOS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWM3GIR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWM3GIR" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x485">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1P1IF" edc:mask="0x1" edc:name="S1P1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1P2IF" edc:mask="0x1" edc:name="S1P2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWM3GIE" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWM3GIE" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x486">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1P1IE" edc:mask="0x1" edc:name="S1P1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1P2IE" edc:mask="0x1" edc:name="S1P2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="PWM3CON" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="PWM3CON" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x487">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERSNOW" edc:mask="0x1" edc:name="ERSNOW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERSPOL" edc:mask="0x1" edc:name="ERSPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:mask="0x1" edc:name="LD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="PWM3S1CFG" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="PWM3S1CFG" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x488">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x7" edc:name="MODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PPEN" edc:mask="0x1" edc:name="PPEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="POL1" edc:mask="0x1" edc:name="POL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POL2" edc:mask="0x1" edc:name="POL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3S1P1" edc:desc="" edc:name="PWM3S1P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x489">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x489">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P1L" edc:mask="0xff" edc:name="S1P1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P1H" edc:mask="0xff" edc:name="S1P1H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
